Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: explore and explain relationships between fractions, decimal numbers
nb: utforske og forklare sammenhenger mellom brøker, desimaltall og

source: understand and make use of numbers and quantities in practical situations
nb: forstå og bruke tall og størrelser i praktiske situasjoner

source: describe this process from observations, models and weather maps to the final weather reports
nb: gjøre rede for redningstjenestens oppbygning og funksjon, og beskrive prinsipper for organisering og ledelse på ulike skadesteder

source: explain important parts of the United Nations' Declaration of Human Rights, and talk about the significance of this
nb: forklare viktige deler av FNs verdenserklæring om menneskerettigheter og samtale om betydningen av dem

source: were largely prepared with a basis in the four levels of the Common European Framework of Reference for Languages (A1, A2, B1 and B2).
nb: for en stor del utarbeidet med utgangspunkt i de fire første nivåene i det europeiske rammeverket (A1, A2, B1 og B2).

source: interpret, process, assess and discuss the mathematical content of written, oral and graphic presentations
nb: tolke, bearbeide, vurdere og diskutere det matematiske innholdet i skriftlige, muntlige og grafiske framstillinger

source: Organic chemistry 2
nb: Organisk kjemi 2

source: elaborate on sampling and digital processing of sound
nb: gjøre rede for sampling og digital behandling av lyd

source: perform experiments with water and light and discuss the observations
nb: gjøre forsøk med vann og lys og samtale om observasjonene

source: Geosciences - Programme subject in programme for Specialization in General Studies (GFG1-01)
nb: Læreplan i geofag - programfag i utdanningsprogram for studiespesialisering (GFG1-01)

source: Oral skills in art and crafts involve being able to express and reflect on aesthetic experiences and creative processes.
nb: Muntlige ferdigheter i kunst og håndverk er å kunne sette ord på og reflektere over estetiske opplevelser og skapende prosesser.

source: order and group data, find and discuss and elaborate on the median, mode, average and spread, and present data with and without digital tools, and discuss and elaborate on different ways of presenting data and what impressions these can give
nb: ordne og gruppere data, finne og drøfte median, typetall, gjennomsnitt og variasjonsbredde, presentere data, med og uten digitale verktøy, og drøfte ulike dataframstillinger og hvilket inntrykk de kan gi

source: use plane geometry to analyse and solve composite theoretical and practical problems connected to lengths, angles and areas
nb: bruke geometri i planet til å analysere og løse sammensatte teoretiske og praktiske problemer med lengder, vinkler og areal

source: Norwegian students encountered trigonometric equations in 2MX, mainly in the form of simple equations such as 4 sin
nb: Norske elever møtte trigonometriske likninger i 2MX, da gjerne i form av enkle likninger som for eksempel 4 sin

source: She carried out observations at the kindergarten for a total of 14 days at the onset of the project.
nb: Hun gjorde observasjoner i barnehagen i til sammen 14 dager ved starten av prosjektet.

source: One of the purposes of the programme subject is to provide insight into the significance of chemistry and its various applications in everyday life and society.
nb: Et formål med programfaget er å gi innsikt i kjemiens ulike anvendelser og betydningen av kjemi i hverdagsliv og samfunn.

source: analyse characteristics of two- and three-dimensional figures and describe physical objects from day-to-day life and technology using geometric terms
nb: analysere egenskaper ved to- og tredimensjonale figurer og beskrive fysiske gjenstander innenfor dagligliv og teknologi ved hjelp av geometriske begreper

source: elaborate on and discuss the relationship between cultural values and forms of communication within and between cultures
nb: drøfte sammenhengen mellom kulturelle verdier og kommunikasjonsformer innenfor og mellom kulturer

source: recognise humanistic art and make use of aesthetic expression related to HumanismLæreplan i kristendom, religion, livssyn og etikk (KRLE)
nb: samtale om hvordan livssynshumanisme kommer til uttrykk gjennom leveregler, seremonier og kunstLæreplan i kristendom, religion, livssyn og etikk - samisk

source: talk about current philosophical and ethical questions, and discuss challenges related to these themes: poverty and wealth, war and peace, nature and environment and Information & Communication Technologies and society
nb: samtale om aktuelle filosofiske og etiske spørsmål og diskutere utfordringer knyttet til temaene fattig og rik, krig og fred, natur og miljø, IKT og samfunn

source: Reading involves comprehending and deriving meaning from texts in different genres on screen and in direct communication while taking a critical and independent view of the texts.
nb: Å kunne avlese omfatter både å kunne finne informasjon i ulike tekster, å lære fag og å oppleve og oppfatte resonnementer og framstillinger i et bredt spekter av tekstformer.

source: use communication technology to cooperate with others, and to find and interact with authentic language
nb: Bruk av digitale verktøy kan også støtte og utvikle elevenes kommunikasjonsferdigheter og presentasjoner.

source: It also involves structuring subject matter, logical and analytical argumentation and showing how economic theory can be applied to practical and topical problems.
nb: Det betyr også å strukturere fagstoff, argumentere logisk og analytisk og vise hvordan økonomisk teori kan anvendes på praktiske og aktuelle problemstillinger.

source: read and write texts related to his/her own education programme
nb: lese og skrive fagtekster med tilknytning til eget utdanningsprogram

source: This includes listening, reading, writing, oral production and spontaneous interaction in various communication situations, media, genres and language functions.
nb: I hovedområdet inngår utforsking av samisk språk der sentrale elementer er egen språkbruk, nåtidsspråk og hvordan språkbruk er situasjons- og kontekstavhengig.

source: The main subject area introduces analytical tools as the basis for a holistic and balanced understanding of religions.
nb: I hovedområdet introduseres analyseverktøy som grunnlag for en helhetlig og balansert forståelse av de enkelte religionene.

source: Feed and feeding of farmed organisms and species-specific dietary requirements are central elements in the programme subject.
nb: Fôr og fôring av oppdrettsorganismer og artsspesifikke næringskrav er sentrale elementer i programfaget.

source: This involves respect for religious values, human rights in general and the ethical foundation of all human rights.
nb: Dette innebærer respekt for religiøse verdier, menneskerettighetene og menneskerettighetenes etiske grunnlag.

source: It also focuses on coordinates, equations and vectors, which are used to determine figures and calculate lengths, angles, area and volume.
nb: Videre dreier det seg om koordinater, likninger og vektorer som brukes til å bestemme figurer og beregne lengder, vinkler, areal og volum.

source: The main subject area deals with the measurement, calculation and analysis of figures in the plane.
nb: Hovedområdet handler om måling, regning og analyse av figurer i planet.

source: This subject area shall deal with the different traditions and religious communities within Christianity.
nb: På ungdomstrinnet skal dette hovedområdet også gi innblikk i andre urfolks religioner.

source: solve simple equations, solve problems using brackets for addition, subtraction and multiplication of whole numbers
nb: stille opp og løse enkle ligninger, og løse opp og regne med parenteser i addisjon, subtraksjon og multiplikasjon av tall

source: The researcher noticed that this action triggered a lot of activity and cooperation among the children.
nb: Dette skapte stor aktivitet og samarbeid i barnegruppa, så forskeren.

source: recognise some constellations and describe phenomena that can be observed in the sky
nb: gjenkjenne noen stjernebilder og beskrive fenomener som kan observeres på himmelen

source: The main subject area comprises different aspects of the concept of culture and the relationship between culture, society and the individual, sub-cultures and norms.
nb: Hovedområdet omfatterulike sider ved kulturbegrepet og forholdet mellom kultur, samfunn og individ, subkulturer og normer.

source: They demonstrate and develop their competence in the subject when they show that they can reflect on their own and others’ place in society, and how they can influence their own, and others’ lives, both in the present day and in the future.
nb: Elevene viser og utvikler også kompetanse når de reflekterer over seg selv og andre som en del av samfunnet, og hvordan de kan påvirke sitt eget og andres liv i dag og i framtiden.

source: Core concepts in the subject area are linear, quadratic and rational expressions, logarithmic expressions, exponential expressions and exponential growth.
nb: Sentrale begreper i hovedområdet er lineære, kvadratiske og rasjonale uttrykk, logaritmeuttrykk, eksponentialuttrykk og eksponentiell vekst

source: tell others about animals and discuss what is good animal welfare
nb: fortelle om dyr og samtale om hva god dyrevelferd er

source: Coordination with instruction in reading and writing in the pupil’s mother tongue and with bilingual technical training may strengthen the teaching in basic Norwegian.
nb: Samordning med lese- og skriveopplæring i morsmål og tospråklig fagopplæring kan styrke opplæringen i grunnleggende norsk.

source: It means confidence in choice of operation and confidence in applying various arithmetical operations without the use of digital tools.
nb: Det innebærer fortrolighet med valg av operasjon og fortrolighet med de ulike regneoperasjonene uten bruk av digitale verktøy.

source: Local authorities are to produce an annual status report on the learning environment, learning outcomes and
nb: Barnehage- og skoleeier har i samarbeid med enhetsledelsen ansvaret for oppfølging av rapporten.

source: The study proved to Skreland that her assumptions were correct.
nb: Studien har vist Skreland at hun hadde rett i sine antakelser.

source: solve equations, inequality and systems of equations of the first and second degree, in longhand and by digital means
nb: løse likninger, ulikheter og likningssystemer av første og andre grad, både ved regning og med digitale hjelpemidler

source: lower quality or equity than OecD average
nb: koordinere et nettverk av fylkesansvarlige.

source: compare and show similarities and differences between countries in Europe and countries in other regions of the world
nb: sammenligne og påvise likheter og forskjeller mellom land i Europa og land i andre verdensdeler

source: In our general knowledge it is important to realise that natural science is developing, and that research and new knowledge in natural science and technology have great importance for societal development and the environment in which we live.
nb: En viktig del av allmennkunnskapen er å kjenne til at naturvitenskapen er i utvikling, og at forskning og ny kunnskap i naturvitenskap og teknologi har stor betydning for samfunnsutviklingen og for livsmiljøet.

source: Natural science is the result of human curiosity and our need to find answers to questions about our existence, life and life forms, and our place in nature and the universe, and in this way it becomes part of our culture.
nb: Naturvitenskapen har vokst fram som en følge av menneskers nysgjerrighet og behov for å finne svar på spørsmål om sin egen eksistens, liv og livsformer og vår plass i naturen og i universet og er på den måten en del av vår kultur.

source: ‘This is not our tradition.
nb: «Dette er ikke vår tradisjon.

source: Skreland asks a little boy why they have a rule about not climbing on the roof of the playhouse.
nb: Skreland spør en liten gutt om hvorfor de har en regel om å ikke klatre på lekehustaket.

source: produce and evaluate own texts in different genres
nb: produsere og vurdere egne tekster i ulike sjangere

source: Numeracy in mathematics refers to using mathematical representations, concepts and methods to make calculations and assess whether solutions are valid.
nb: Å kunne regne i matematikk vil si å bruke matematiske representasjoner, begreper og framgangsmåter til å gjøre utregninger og vurdere om løsninger er gyldige.

source: in Machines involves doing calculations in connection with pressure, temperature, electrical quantities, fluid mixing ratios and the financial consequences of use of resources and method selection.
nb: i programområde for arbeidsmaskiner innebærer å utføre beregninger knyttet til trykk, temperatur, elektriske størrelser, blandingsforhold i væsker og økonomiske konsekvenser av ressursbruk og metodevalg.

source: It means working with and interpreting formulas, models and various types of data, as well as solving equations.
nb: Det betyr å bruke, bearbeide og tolke formler, modeller og ulike typer data, og å løse likninger.

source: body and health,
nb: ernæring og helse

source: The inspiration for the second article in the series was drawn from a kindergarten at Södermalm in Stockholm, Sweden.
nb: Inspirasjon til den andre artikkelen i serien er hentet fra en barnehage på Södermalm i Stockholm.

source: The international news media and certain players in music, film and other cultural outlets often use English.
nb: Internasjonale nyhetsmedier og en rekke aktører innenfor musikk, film og andre kulturuttrykk benytter ofte engelsk.

source: formulate a problem from current social science issues and write a discursive text using terminology, varied sources and referencing to sources
nb: formulere en aktuell samfunnsfaglig problemstilling og skrive en drøftende tekst med bruk av fagbegreper, variert kildebruk og kildehenvisninger

source: The Finnish researcher Anna-Maija Puroila headed this study.
nb: Den finske forskeren Anna-Maija Puroila ledet denne studien.

source: It also deals with how chemical processes in water are affected by pH.
nb: Videre dreier det seg om hvordan kjemiske prosesser som skjer i vann, blir påvirket av pH.

source: In some cases, to explore means to investigate different aspects of an issue through open and critical discussion.
nb: I noen tilfeller betyr det å undersøke ulike sider av en sak gjennom åpen og kritisk drøfting.

source: Only a small part of Norwegian teachers stated that they had such depth in mathematics education.
nb: Det er en liten andel av de norske lærerne som oppgir at de har fordypning i matematikkdidaktikk.

source: discuss current questions that arise in the meeting between religion, culture and society
nb: gi en oversikt over viktige historiske hendelser og livssynshumanismens stilling i Norge og i verden i dag

source: The main subject area covers empirical functions, polynomial functions, power functions, rational functions, logarithmic functions and exponential functions.
nb: Hovedområdet omfatter empiriske funksjoner, polynomfunksjoner, potensfunksjoner, rasjonale funksjoner, logaritmefunksjoner og eksponentialfunksjoner.

source: In their day-to-day activities, the families staff encounter often have traditional attitudes.
nb: I det daglige var det særlig tradisjonelle holdninger i familiene de møtte.

source: It also involves being able to search for essential documents and communicate with customers.
nb: Det innebærer også å kunne søke etter styrende dokumenter og å kunne kommunisere med kunder.

source: In this way linguistic and cultural competence contributes to a sound upbringing and fosters democratic commitment and responsible citizenship.
nb: Slik ivaretar språk- og kulturkompetanse det allmenndannende perspektivet og bidrar til å styrke demokratisk engasjement og medborgerskap.

source: compare the construction of a diode and transistor, explain how they work, and give examples of their use
nb: sammenligne oppbygningen og forklare virkemåten til en diode og en transistor, og gi eksempler på bruken av dem

source: In Norway, 38% of the 3MX students are girls, and in Sweden 40%.
nb: I Norge er 38 % av 3MX-elevene jenter, i Sverige er andelen jenter 40 %.

source: people different opportunities for democratic participation
nb: konfliktsituasjoner og vurdere konsekvenser av valgene de har tatt

source: constructs in an oral English examination in Norway.
nb: kommunen og er øverste plan- og budsjettmyndighet.

source: When they come in from the cold, it feels wonderful to come into this warm space and be wrapped in a blanket.’
nb: Når de kommer inn fra kulda, er det spesielt godt å komme inn i dette varme rommet og få et teppe rundt seg.

source: use digital tools to find information and create text
nb: bruke digitale verktøy for å hente informasjon og eksperimentere med å skape tekst

source: New sections: Responsibility and collaboration, Infection control measures for employees, Students with special needs and special schools, Adult education
nb: Det er ikke nødvendig å sette inn ytterligere tiltak enn det som er beskrevet her med mindre annet blir bestemt av lokale eller nasjonale helsemyndigheter.

source: discuss and elaborate on Christianity's significance for culture and society
nb: gi en oversikt over andre frikirkesamfunn og kristne bevegelser, herunder pinsebevegelsen

source: discuss and elaborate on the value of gender equality and the consequences of a labour market segregated by gender
nb: diskutere verdien av likestilling og konsekvenser av et kjønnsdelt arbeidsmarked

source: should be seen in relation to learning (OECD 2005).
nb: vil seie at vurdering skal vere en del av læringa (OeCd 2005).

source: From an ecological, sustainable and ethical perspective, teaching shall help develop the ability to cooperate and to think reflectively, creatively and interdisciplinary.
nb: I økologisk, bærekraftig og etisk perspektiv skal opplæringen bidra til å utvikle evne til samarbeid, refleksjon, kreativitet og tverrfaglig tenkning.

source: Caiman postulates that kindergarten staff play an important part in these processes.
nb: De ansatte i barnehagen har en viktig rolle i disse prosessene, ser Caiman.

source: explore addition and subtraction and use this to formulate and solve
nb: utforske addisjon og subtraksjon og bruke dette til å formulere og løse

source: Knowledge about the society around us will inspire curiosity and wonder in pupils and stimulate reflection and creative work.
nb: Gjennom kunnskap om samfunnet omkring seg blir elevene undrende og nysgjerrige og stimuleres til refleksjon og skapende arbeid.

source: recognise, use and describe mirror symmetry and parallel displacement in specific situations
nb: gjenkjenne, bruke og beskrive speilsymmetri og parallellforskyvning i konkrete situasjoner

source: When the children wanted to play a game, the adults were good role models.
nb: Når barna skulle leke en lek, var de voksne gode rollemodeller.

source: handle and use chemicals correctly in accordance with information in an EHS data sheet
nb: håndtere og bruke kjemikalier forskriftsmessig i henhold til informasjon i HMS-datablad

source: The main subject area covers international cooperation, terrorism, conflicts, conflict resolution and peace work.
nb: Hovedområdet omfatter internasjonalt samarbeid, terrorisme, konflikter, konfliktløsning og fredsarbeid.

source: Why is it not being documented?’
nb: Hvorfor dokumenteres det ikke?

source: communicate via digital media
nb: kommunisere via digitale medier

source: on one’s own use of resources and the use of resources in Norway in a global and sustainability perspective
nb: over sin egen ressursbruk og ressursbruken i Norge i et globalt og bærekraftig perspektiv

source: Calculator use in 3MX
nb: Bruk av kalkulator i 3MX

source: extract and interpret relevant information from texts relating to
nb: hente ut og tolke relevant informasjon fra tekster om kjøp og salg og

source: measures as much as possible.
nb: Det er summen av tiltak som til

source: use proportions in practical connections, calculate velocity and convert between currencies
nb: Koronaverter kan bidra til bedre etterlevelse av smitteverntiltak i fellesarealer.

source: You see both the child and the situation.’
nb: Både på barnet og situasjonen.

source: analyze linguistic patterns and conversation forms in communicative activities in a variety of situations
nb: analysere språklige mønstre og samtaleformer i kommunikative aktiviteter i ulike situasjoner

source: The pupils demonstrate and develop their competence in social science when they show that they can reflect on the conditions in society, and critically assess and discuss different contexts and perspectives.
nb: Elevene viser og utvikler kompetanse i samfunnskunnskap når de reflekterer over forhold i samfunnet og kritisk vurderer og diskuterer ulike sammenhenger og perspektiver.

source: Some children need help to play
nb: Noen barn trenger hjelp til å leke

source: It also means being able to argue for solutions, and give feedback.
nb: I tillegg vil det si å kunne argumentere for løsninger og gi tilbakemeldinger.

source: The programme subject shall help pupils understand how substances affect the environment, and how the development of new industrial methods can reduce strain on the environment.
nb: Programfaget skal bidra til forståelse for hvordan stoffer påvirker miljøet, og hvordan utvikling av nye industrielle metoder kan redusere belastningen på miljøet.

source: log, sort, present and read data in tables and diagrams, and justify the
nb: logge, sortere, presentere og lese data i tabeller og diagrammer og

source: Thereby indicating that staff in Swedish kindergartens might have a challenge because they consider it a prevalent ideology and belief of children being socially competent human beings.
nb: Hun antyder at ansatte i svenske barnehager kan ha et ­problem ­knyttet til det som er en slags ­rådende ­ideo­logi, iallfall i Sverige, nemlig at barn er sosialt kompetente ­mennesker.

source: Technology and design focuses on planning, developing and making products that are useful in our day-to-day lives.
nb: Teknologi og design dreier seg om å planlegge, utvikle og framstille produkter til nytte i hverdagen.

source: evaluate consumption, use of credit cards and set up a budget and accounts using a spreadsheet
nb: vurdere forbruk og bruk av kredittkort og sette opp budsjett og regnskap ved hjelp av regneark

source: The main subject area also is concerned with central economic problems associated with poor and rich countries.
nb: Hovedområdet dreier seg også om sentrale økonomiske problemstillinger knyttet til fattige og rike land.

source: explain why it is important to make and test hypotheses through systematic observations and experiments, and why it is important to compare results
nb: forklare hvorfor det er viktig å lage og teste hypoteser ved systematiske observasjoner og forsøk, og hvorfor det er viktig å sammenligne resultater

source: in Basic Norwegian for language minorities involves understanding numbers and mathematical concepts.
nb: i grunnleggende norsk for språklige minoriteter innebærer å forstå tall og matematiske begreper.

source: represent and use fractions, decimal numbers and percentages in
nb: representere og bruke brøk, desimaltall og prosent på ulike måter og

source: hold a dialogue with others about the relationship between ethics, religion and philosophies of life
nb: føre dialog med andre om sammenhenger mellom etikk, religioner og livssyn
